app/controllers/api/notes_controller.rb

SELECT "notes".* FROM "notes"
---
  def index
    render json: Note.all